DataProcessors/ТелеграмИИФайловыйМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ТелеграмИИФайловыйМенеджер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ТелеграмОбработкаСообщенийИИАктивные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмОбработкаСообщенийИИАктивные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасположениеПроцедуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазваниеПроцедуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТелеграмКонтакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТелеграмИИФайловыйМенеджер/Ext/ObjectModule.bsl
Процедура ПроцедураДляВызова(СсылкаДокВхСообщение) Экспорт
	
	ПозицияАдресаБота = СтрНайти(СсылкаДокВхСообщение.Текст, Справочники.ТелеграмПараметры.АдресБота.Значение);
	Если ПозицияАдресаБота > 0 Тогда
		ТекстСообщения = Лев(СсылкаДокВхСообщение.Текст, ПозицияАдресаБота-1);
	Иначе
		ТекстСообщения = СсылкаДокВхСообщение.Текст;
	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.ТелеграмОбработкаСообщенийИИАктивные.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТелеграмКонтакт = СсылкаДокВхСообщение.ТелеграмКонтакт;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.РасположениеПроцедуры <> "Обработки.ТелеграмИИФайловыйМенеджер" или МенеджерЗаписи.НазваниеПроцедуры <> "ПроцедураДляВызова"  Тогда
		//Это первая итерация
		МенеджерЗаписи.ТелеграмКонтакт = СсылкаДокВхСообщение.ТелеграмКонтакт;
		МенеджерЗаписи.РасположениеПроцедуры = "Обработки.ТелеграмИИФайловыйМенеджер";
		МенеджерЗаписи.НазваниеПроцедуры = "ПроцедураДляВызова";
		ТекущиеДанные = Новый Структура();
		ТекущиеДанные.Вставить("КолВыполненныхИтераций", 1);
		ТекущиеДанные.Вставить("ПоследнийКаталог", "");
		МассивИмён = Новый Массив();
				
		Текст = "Выберите начальный каталог:";
		НачальныеКаталоги = МассивНачальныхКаталогов();
		МассивИмён.Очистить();
		н = 1;
		Для Каждого ИмяНачКаталога Из НачальныеКаталоги Цикл
			Текст = Текст + Символы.ПС + "/" + Формат(н, "ЧГ=0") + "-" + ИмяНачКаталога; 
			МассивИмён.Добавить(ИмяНачКаталога);
			н = н + 1;
		КонецЦикла;	
		
		ТекущиеДанные.Вставить("МассивИмён", МассивИмён);
		МенеджерЗаписи.ТекущиеДанные = Новый ХранилищеЗначения(ТекущиеДанные);
		МенеджерЗаписи.ДатаЗаписи = ТекущаяДата();
		МенеджерЗаписи.Записать(Истина);		
		
		Сообщение = Новый Структура();
		Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
		Сообщение.Вставить("Текст", Текст);
		ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
		
	Иначе
		ТекущиеДанные = МенеджерЗаписи.ТекущиеДанные.Получить();
		ТекущиеДанные.КолВыполненныхИтераций = ТекущиеДанные.КолВыполненныхИтераций + 1;
		МассивИмён = ТекущиеДанные.МассивИмён;
		
		Если ТекстСообщения = "/Back" Тогда //возвращаемся назад
			НомерПредПоследнегоСлеша = СтрНайти(ТекущиеДанные.ПоследнийКаталог, "\", НаправлениеПоиска.СКонца,, 2);	
			Если НомерПредПоследнегоСлеша > 2 Тогда // когда пусть задан как \\СетевойАдрес, предполседний слеш при начальной директории будет равен 2, если путь это диск то в конструкции типа C:\ он будет равен 0
				ТекущиеДанные.ПоследнийКаталог = Сред(ТекущиеДанные.ПоследнийКаталог, 1, НомерПредПоследнегоСлеша); 		
				СтруктураКаталога = НайтиФайлы(ТекущиеДанные.ПоследнийКаталог, "*");
				Текст = "/Back";
				МассивИмён.Очистить();
				н = 1;
				Для Каждого Элемент Из СтруктураКаталога Цикл
					Если Элемент.ЭтоФайл() Тогда
						РазмерФайла = Элемент.Размер();
						Текст = Текст + Символы.ПС + "/" + Формат(н, "ЧГ=0") + "-" + Элемент.Имя + "(" + ?(РазмерФайла<1000000, Формат((РазмерФайла/1024), "ЧДЦ=1")+ "кб", Формат((РазмерФайла/1048576), "ЧДЦ=1")+ "мб") + ")"; 
					Иначе
						Текст = Текст + Символы.ПС + "/" + Формат(н, "ЧГ=0") + "-" + Элемент.Имя; 	
					КонецЕсли;
					МассивИмён.Добавить(Элемент.Имя);
					н = н + 1;
				КонецЦикла;
				Сообщение = Новый Структура();
				Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
				Сообщение.Вставить("Текст", Текст);
				ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
			Иначе
				ТекущиеДанные.ПоследнийКаталог = "";
				Текст = "Выберите начальный каталог:";
				НачальныеКаталоги = МассивНачальныхКаталогов();
				МассивИмён.Очистить();
				н = 1;
				Для Каждого ИмяНачКаталога Из НачальныеКаталоги Цикл
					Текст = Текст + Символы.ПС + "/" + Формат(н, "ЧГ=0") + "-" + ИмяНачКаталога; 
					МассивИмён.Добавить(ИмяНачКаталога);
					н = н + 1;
				КонецЦикла;	
				Сообщение = Новый Структура();
				Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
				Сообщение.Вставить("Текст", Текст);
				ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
			КонецЕсли;
		Иначе // Обработка выбора файла, каталога, начального каталога
			
			Попытка 
				ВыбранныйИндексМассива = Число(Сред(ТекстСообщения, 2))-1;
				КомандаКоррекнта = Истина;
			Исключение
				КомандаКоррекнта = Ложь;	
			КонецПопытки;
			
			Если КомандаКоррекнта Тогда
				Если МассивИмён.ВГраница() >= ВыбранныйИндексМассива Тогда  
					Если ЗначениеЗаполнено(ТекущиеДанные.ПоследнийКаталог) Тогда // Выбран файл или каталог
						МассивСВыбраннымФайломКаталогом = НайтиФайлы(ТекущиеДанные.ПоследнийКаталог, МассивИмён[ВыбранныйИндексМассива]);
						Если МассивСВыбраннымФайломКаталогом.Количество() <> 1 Тогда
							Текст = "Ошибка, нет такого файла/каталога";
							Сообщение = Новый Структура();
							Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
							Сообщение.Вставить("Текст", Текст);
							ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
						Иначе
							Если МассивСВыбраннымФайломКаталогом[0].ЭтоКаталог() Тогда
								
								ТекущиеДанные.ПоследнийКаталог = ТекущиеДанные.ПоследнийКаталог + МассивИмён[ВыбранныйИндексМассива] + "\";
								СтруктураКаталога = НайтиФайлы(ТекущиеДанные.ПоследнийКаталог, "*");
								Текст = "/Back";
								МассивИмён.Очистить();
								н = 1;
								Для Каждого Элемент Из СтруктураКаталога Цикл
									Если Элемент.ЭтоФайл() Тогда
										РазмерФайла = Элемент.Размер();
										Текст = Текст + Символы.ПС + "/" + Формат(н, "ЧГ=0") + "-" + Элемент.Имя + "(" + ?(РазмерФайла<1000000, Формат((РазмерФайла/1024), "ЧДЦ=1")+ "кб", Формат((РазмерФайла/1048576), "ЧДЦ=1")+ "мб") + ")"; 
									Иначе
										Текст = Текст + Символы.ПС + "/" + Формат(н, "ЧГ=0") + "-" + Элемент.Имя; 	
									КонецЕсли;
									МассивИмён.Добавить(Элемент.Имя);
									н = н + 1;
								КонецЦикла;
								Сообщение = Новый Структура();
								Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
								Сообщение.Вставить("Текст", Текст);
								ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
							ИначеЕсли МассивСВыбраннымФайломКаталогом[0].ЭтоФайл() Тогда
								
								РазмерФайла = МассивСВыбраннымФайломКаталогом[0].Размер();
								ПутьФайла = МассивСВыбраннымФайломКаталогом[0].ПолноеИмя;
								
								Если РазмерФайла > 52428800 Тогда // Телеграм не разрешает отправлять файлы больше 50 мб 
									//Отправляем уведомление что нельзя отправлять файлы больше 50 мб
									Сообщение = Новый Структура();
									Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
									Сообщение.Вставить("Текст", "Нельзя отправлять файлы размером больше 50мб");
									ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
									
								Иначе // Отправляем файл
									
									//Отправляем уведомление что начинаем отправку файла
									Сообщение = Новый Структура();
									Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
									Сообщение.Вставить("Текст", "Начата отправка """ + МассивИмён[ВыбранныйИндексМассива] + "(" + ?(РазмерФайла<1000000, Формат((РазмерФайла/1024), "ЧДЦ=1")+ "кб", Формат((РазмерФайла/1048576), "ЧДЦ=1")+ "мб") + ")" + """ ждите...");
									ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
									
									//Отправляем файл
									Сообщение = Новый Структура();
									Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
									Сообщение.Вставить("ФайлПуть", ТекущиеДанные.ПоследнийКаталог + МассивИмён[ВыбранныйИндексМассива]);
									Сообщение.Вставить("ФайлТип", "document");
									ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
								КонецЕсли;
							Иначе // выбрано чтото другое??? сделаем запись о исключении
								ОписаниеОшибки = "был выбран файл который не является ни каталогом, ни файлом. Путь: " + ТекущиеДанные.ПоследнийКаталог + МассивИмён[ВыбранныйИндексМассива];
								ЗаписьВЖурналОшибок("Обработки.ТелеграмИИФайловыйМенеджер.МодульОбъекта", "ПроцедураДляВызова", ОписаниеОшибки);	
							КонецЕсли;				
						КонецЕсли;
					Иначе // Выбран начальный каталог, проверку не выполняем  
						ТекущиеДанные.ПоследнийКаталог = ТекущиеДанные.ПоследнийКаталог + МассивИмён[ВыбранныйИндексМассива];
						СтруктураКаталога = НайтиФайлы(ТекущиеДанные.ПоследнийКаталог, "*");
						Текст = "/Back";
						МассивИмён.Очистить();
						н = 1;
						Для Каждого Элемент Из СтруктураКаталога Цикл
							Если Элемент.ЭтоФайл() Тогда
								РазмерФайла = Элемент.Размер();
								Текст = Текст + Символы.ПС + "/" + Формат(н, "ЧГ=0") + "-" + Элемент.Имя + "(" + ?(РазмерФайла<1000000, Формат((РазмерФайла/1024), "ЧДЦ=1")+ "кб", Формат((РазмерФайла/1048576), "ЧДЦ=1")+ "мб") + ")"; 
							Иначе
								Текст = Текст + Символы.ПС + "/" + Формат(н, "ЧГ=0") + "-" + Элемент.Имя; 	
							КонецЕсли;
							МассивИмён.Добавить(Элемент.Имя);
							н = н + 1;
						КонецЦикла;
						Сообщение = Новый Структура();
						Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
						Сообщение.Вставить("Текст", Текст);
						ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
					КонецЕсли;	
				Иначе
					// индекс больше максимального
					Текст = "Ошибка, такого файла/каталога в " + ТекущиеДанные.ПоследнийКаталог + " не существует";
					Сообщение = Новый Структура();
					Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
					Сообщение.Вставить("Текст", Текст);
					ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
				КонецЕсли;	
			Иначе
				// Если прислали чтото другое, то не обрабатываем и ошибку не вызываем, бот может работать в группе с обсуждением 
			КонецЕсли;				
		КонецЕсли;
		
		ТекущиеДанные.МассивИмён = МассивИмён;
		МенеджерЗаписи.ТекущиеДанные = Новый ХранилищеЗначения(ТекущиеДанные);
		МенеджерЗаписи.ДатаЗаписи = ТекущаяДата();
		МенеджерЗаписи.Записать(Истина);
						

	КонецЕсли;

	
КонецПроцедуры

Функция МассивНачальныхКаталогов()
	
	Каталоги = Новый Массив();
	
	Каталоги.Добавить("C:\");
	Каталоги.Добавить("\\192.168.1.10\семейная библиотека\");	
	
	Возврат Каталоги;
	
КонецФункции
